Matchline top extent should be higher than its bottom.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CreationFailed { get; }
  Visual Basic
Public Shared ReadOnly Property CreationFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CreationFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MatchlineFailures Class
  Autodesk.Revit.DB Namespace